import React from "react";
import "./attraction.css";

const attractions = [
    {
      name: "ಶ್ರೀ ಸಿಗಂದೂರು ಚೌಡೇಶ್ವರಿ ದೇವಾಲಯ",
      description: "ಅಪಾರ ಮಹಿಮೆಯುಳ್ಳ ದೈವೀ ಶಕ್ತಿ ಪೀಠಗಳಲ್ಲಿ ಶ್ರೀ ಸಿಗಂದೂರು ಚೌಡೇಶ್ವರಿ ಅಮ್ಮನವರ ಕ್ಷೇತ್ರವೂ ಒಂದು. ಇಲ್ಲಿನ ದೇವಿಯ ದರ್ಶನವನ್ನು ಪಡೆಯಲು ದೇಶ ವಿದೇಶಗಳಿಂದ ಭಕ್ತರು ಭೇಟಿ ನೀಡುತ್ತಾರೆ. ಶ್ರೀ ಸಿಗಂದೂರು ಚೌಡೇಶ್ವರಿ ದೇವಸ್ಥಾನವು ಭಾರತದ ಕರ್ನಾಟಕ ರಾಜ್ಯದ ಶಿವಮೊಗ್ಗದ ಸಿಗಂದೂರು, ಕಳಸವಳ್ಳಿಯಲ್ಲಿದೆ. ಈ ದೈವಿಕ ದೇವಾಲಯವು ಸಿಗಂದೂರು ಗ್ರಾಮದ ಪ್ರಮುಖ ಆಕರ್ಷಣೆಯ ಶಕ್ತಿಯಾಗಿದೆ.",
      distance: "0.4km from KRS Guest House",
      image: "sigandur.jpg",
    },
    {
      name: "ಶರಾವತಿ ನದಿ",
      description: "ಶರಾವತಿ ನದಿಯು ತೀರ್ಥಹಳ್ಳಿ ತಾಲೂಕಿನ ಅಂಬುತೀರ್ಥ ಎಂಬ ಸ್ಥಳದಲ್ಲಿ ಹುಟ್ಟುತ್ತದೆ . ಪುರಾತನ ದಂತಕಥೆಯ ಪ್ರಕಾರ, ರಾಮ ದೇವರು ತನ್ನ ಅಂಬು (ಬಿಲ್ಲು ಮತ್ತು ಬಾಣ ಎಂದು ಅನುವಾದಿಸುತ್ತದೆ) ತನ್ನ ಹೆಂಡತಿ ಸೀತಾ ಬಾಯಾರಿಕೆಯಿಂದ ನೆಲಕ್ಕೆ ಹೊಡೆದನು . ಅವನ ಬಾಣವು ನೆಲಕ್ಕೆ ಬಡಿದಾಗ, ನೀರು ಸುರಿಯಿತು (ತೀರ್ಥ ಎಂದು ಅನುವಾದಿಸುತ್ತದೆ) ಮತ್ತು ಅವಳ ಬಾಯಾರಿಕೆಯನ್ನು ನೀಗಿಸಿತು. ದಂತಕಥೆಯ ಪ್ರಕಾರ ನದಿಯು ಈ ಘಟನೆಯೊಂದಿಗೆ ಹುಟ್ಟಿಕೊಂಡಿರುವುದರಿಂದ, ನದಿಯನ್ನು ಶರಾವತಿ ಎಂದು ಕರೆಯಲಾಗುತ್ತದೆ.",
      distance: "4km from KRS Guest House",
      image: "Sharavthi.jpg",
    },
    {
      name: "ಜೋಗ ಜಲಪಾತ",
      description: "ಜೋಗ ಜಲಪಾತ ಭಾರತದಲ್ಲಿ ಎರಡನೇ ಅತ್ಯಧಿಕ ಧುಮುಕುವ ಜಲಪಾತವಾಗಿದೆ. ಇದು ಮಳೆ ಮತ್ತು ಋತುವಿನ ಮೇಲೆ ಅವಲಂಬಿತವಾಗಿರುವ ಒಂದು ವಿಭಜಿತ ಜಲಪಾತವಾಗಿದೆ. ಶಿವಮೊಗ್ಗ ಜಿಲ್ಲೆ ಸಾಗರ ತಾಲ್ಲೂಕಿನ ಜೋಗ ಜಲಪಾತ ವೀಕ್ಷಣಾ ಸ್ಥಳ ಒಂದು ಪ್ರಮುಖ ಪ್ರವಾಸಿ ಆಕರ್ಷಣೆಯಾಗಿದೆ ಮತ್ತು ಜಲಪಾತ ಪಟ್ಟಿಯಲ್ಲಿ ಪ್ರಪಂಚದಲ್ಲೇ 13 ನೇ ಸ್ಥಾನದಲ್ಲಿದೆ. ಈ ಜಲಪಾತವನ್ನು ಗೇರುಸೊಪ್ಪ ಜಲಪಾತ ಹಾಗೂ ಜೋಗದಗುಂಡಿ ಎಂದು ಕೂಡ ಕರೆಯುತ್ತಾರೆ.",
      distance: "70 km from KRS Guest House",
      image: "jogfalls.jpg",
    },
    {
        name: "ಕೊಡಚಾದ್ರಿ",
        description: "ಕೊಡಚಾದ್ರಿಯು ದಟ್ಟವಾದ ಕಾಡುಗಳನ್ನು ಹೊಂದಿರುವ ಪರ್ವತ ಶಿಖರವಾಗಿದೆ, ಸಮುದ್ರ ಮಟ್ಟದಿಂದ ಸುಮಾರು 1343 ಮೀ ಗಳಷ್ಟು ಎತ್ತರದಲ್ಲಿದೆ. ಇದು ಕರ್ನಾಟಕ ಸರ್ಕಾರದಿಂದ ಪಾರಂಪರಿಕ ನೈಸರ್ಗಿಕ ಸ್ಥಳದ ಮಾನ್ಯತೆ ಪಡೆದಿದೆ.",
        distance: "40 km from KRS Guest House",
        image: "kodachadri.jpg",
      },{
        name: "ಕೊಲ್ಲೂರು ಮೂಕಾಂಬಿಕಾ ದೇವಸ್ಥಾನ",
        description: "ಕೊಲ್ಲೂರು ಮೂಕಾಂಬಿಕಾ ದೇವಸ್ಥಾನವು ಕರ್ನಾಟಕದ ದಕ್ಷಿಣ ಭಾರತದ ಅತ್ಯಂತ ಪ್ರಸಿದ್ಧ ದೇವಾಲಯವಾಗಿದೆ. ಪರಶುರಾಮನು ಸೃಷ್ಟಿಸಿದ ಮೋಕ್ಷದ ಏಳು ವಾಸಸ್ಥಾನಗಳಲ್ಲಿ ಇದು ಒಂದು ಎಂದು ಹೇಳಲಾಗುತ್ತದೆ. ಮೂಕಾಂಬಿಕಾ ದೇವಸ್ಥಾನವು ಕರ್ನಾಟಕದ ಉಡುಪಿ ಜಿಲ್ಲೆಯ ಕೊಲ್ಲೂರಿನಲ್ಲಿದೆ. ಈ ದೇವಾಲಯವು ಕಲೆ ಮತ್ತು ಜ್ಞಾನಕ್ಕೆ ಸಮರ್ಪಿಸಲಾಗಿದೆ. ಮೂಕಾಂಬಿಕಾ ದೇವಿಯನ್ನು ಮಾತು ಮತ್ತು ಅಕ್ಷರಗಳ ದೇವತೆ ಎಂದು ಪರಿಗಣಿಸಲಾಗುತ್ತದೆ. ದೇವಿಯ ವಿಗ್ರಹವನ್ನು “ಪಂಚಲೋಹಾ” (ಐದು ಲೋಹಗಳು) ಬಳಸಿ ತಯಾರಿಸಲಾಗಿದೆ ಅವುಗಳೆಂದರೆ - ಚಿನ್ನ, ಬೆಳ್ಳಿ, ತಾಮ್ರ, ಕಬ್ಬಿಣ ಮತ್ತು ಸೀಸ.",
        distance: "50 km from KRS Guest House",
        image: "kollur.png",
        },
        {
        name: "ಶ್ರೀ ಶ್ರೀಧರ ಸ್ವಾಮಿ ಆಶ್ರಮ, ವರದಹಳ್ಳಿ",
        description: "ಕರ್ನಾಟಕದ ಶಿವಮೊಗ್ಗ ಜಿಲ್ಲೆಯ ವರದಹಳ್ಳಿ ಗ್ರಾಮದಲ್ಲಿರುವ ಶ್ರೀ ಶ್ರೀಧರ ಸ್ವಾಮಿ ಆಶ್ರಮವು ಒಂದು ಪ್ರಸಿದ್ಧ ಬೆಟ್ಟದ ದೇವಾಲಯವಾಗಿದೆ. ಇದನ್ನು 1954 ರಲ್ಲಿ ಮಹಾರಾಷ್ಟ್ರದ ಸಜ್ಜನಘಡದ ಶ್ರೀಧರ ಸ್ವಾಮಿ ಎಂಬ ಸಂತರು ಸ್ಥಾಪಿಸಿದರು. ಅವರು ತಮ್ಮ ಆಧ್ಯಾತ್ಮಿಕ ಧ್ಯಾನವನ್ನು ಮುಂದುವರಿಸಲು ಆಶ್ರಮವನ್ನು ಸ್ಥಾಪಿಸಿದರು. ಜನರು ಅವರ ಆಧ್ಯಾತ್ಮಿಕ ಮತ್ತು ಧಾರ್ಮಿಕ ಭಕ್ತಿಯ ಬಗ್ಗೆ ತಿಳಿದುಕೊಂಡಂತೆ, ಕರ್ನಾಟಕ ಮತ್ತು ಮಹಾರಾಷ್ಟ್ರ ರಾಜ್ಯಗಳಿಂದ ಅನೇಕರು ಅವರ ತತ್ವಗಳು ಮತ್ತು ಸಿದ್ಧಾಂತಗಳನ್ನು ನಂಬಲು ಪ್ರಾರಂಭಿಸಿದರು. ಜನರು ಅವರ ಭಕ್ತರಾಗಲು ಪ್ರಾರಂಭಿಸಿದರು. 1973 ರಲ್ಲಿ ಸ್ವಾಮಿಗಳು ತಮ್ಮ ಸ್ವರ್ಗೀಯ ಪ್ರಯಾಣಕ್ಕಾಗಿ ತಮ್ಮ ದೇಹವನ್ನು ತೊರೆದಾಗ, ಅವರು ಅನೇಕ ಅನುಯಾಯಿಗಳನ್ನು ರಚಿಸಿಕೊಂಡಿದ್ದರು. ಅವರ ಭಕ್ತರು ಮತ್ತು ಅನುಯಾಯಿಗಳು ಆಶ್ರಮದೊಳಗೆ ಅವರ ಸಮಾಧಿಯನ್ನು ನಿರ್ಮಿಸಿದರು. ಇಂದಿಗೂ, ಭಕ್ತರು ಆಶ್ರಮಕ್ಕೆ ಭೇಟಿ ನೀಡುತ್ತಾರೆ, ಆ ಧರ್ಮನಿಷ್ಠ ವ್ಯಕ್ತಿಯ ಆಶೀರ್ವಾದವನ್ನು ಪಡೆಯಲು.",
        distance: "38 km from KRS Guest House",
        image: "varadhalli.jpg",
        },
        {
        name: "ಕೆಳದಿ ರಾಮೇಶ್ವರ ದೇವಸ್ಥಾನ",
        description: "ರಾಮೇಶ್ವರ ದೇಗುಲದಲ್ಲಿ ಇಕ್ಕೇರಿ, ಬನವಾಸಿಗಳಲ್ಲಿದ್ದಂತೆ ಆಳೆತ್ತರದ ನಂದಿಯಿರದೇ, ಶಿವನೆದುರು ಪುಟ್ಟ ನಂದಿಯಿದ್ದಾನೆ. ಬೆಳಗ್ಗಿನ ಸಮಯದಲ್ಲಿ ಅಥವಾ ಸಂಜೆ ೫ ರ ಮೇಲೆ ಹೋದರೆ ದೇವರ ದರ್ಶನ ಪಡೆಯಬಹುದು. ಈ ದೇಗುಲದ ಎದುರಿನ ನೆಲದಲ್ಲಿ ಹುಲಿ ಹಸು ಆಟದ ಪಟವನ್ನು, ಹಳಗನ್ನಡದ ಬರಹಗಳನ್ನೂ ಕಾಣಬಹುದು.",
        distance: "46 km from KRS Guest House",
        image: "keladi.jpg",
        },
        {
        name: "ಇಕ್ಕೇರಿ-ಅಘೋರೇಶ್ವರ ದೇವಸ್ಥಾನ",
        description: "ಅಘೋರೇಶ್ವರ ದೇವಸ್ಥಾನವು ಹೊಯ್ಸಳ-ಕದಂಬ ಶೈಲಿಯಲ್ಲಿದೆ.ಉತ್ತರ-ದಕ್ಷಿಣ ದಿಕ್ಕಿನಲ್ಲಿರುವ ಈ ದೇಗುಲವು ಗರ್ಭಗೃಹ, ಅರ್ಧಮಂಟಪ, ಮುಖಮುಂಟಪ ಮತ್ತು ಎದುರಿಗೆ ನಂದಿಗೆ ಪ್ರತ್ಯೇಕ ಮಂಟಪವನ್ನು ಹೊಂದಿದೆ.ಗರ್ಭಗೃಹದಲ್ಲಿ ಕಲ್ಲಿನ ಶಿವಲಿಂಗವಿದೆ. ಈ ದೇವಾಲಯದಲ್ಲಿ ೩೨ ಕೈಗಳ ಅಘೋರೇಶ್ವರನ ಉತ್ಸವ ಮೂರ್ತಿಯಿದೆ. ಅರ್ಧಮಂಟಪದಲ್ಲಿ ಬಿಳಿ ಕಲ್ಲಿನಿಂದ (ಅಮೃತ ಕಲ್ಲಿನಿಂದ) ಕೆತ್ತಿದ ಸಣ್ಣ ನಂದಿಯಿದೆ. ಅರ್ಧಮಂಟಪದ ದ್ವಾರದಲ್ಲಿ ಎರಡೂ ಬದಿಯಲ್ಲಿ ಅಘೋರೇಶ್ವರನ ಪರಿವಾರದ ಕೆತ್ತನೆಗಳಿವೆ. ಎಡಭಾಗದಲ್ಲಿ ಮಹಿಷಮರ್ದಿನಿ, ಭೈರವನ ಕೆತ್ತನೆಗಳಿದ್ದರೆ ಬಲಭಾಗದಲ್ಲಿ ಗಣಪತಿ, ಷಣ್ಮುಖನ ಕೆತ್ತನೆಗಳಿವೆ. ಎದುರಿನ ಮುಖಮಂಟಪ ಕೆತ್ತನೆಯಿರುವ ಕಂಬಗಳ ಆಧಾರದ ಮೆಲೆ ನಿಂತಿದೆ. ದೇಗುಲವು ದ್ರಾವಿಡ ಶೈಲಿಯ ಕಳಸವನ್ನು ಹೊಂದಿದೆ. ದೇಗುಲದ ಪಶ್ಚಿಮದಲ್ಲಿ ಇದೇ ಶೈಲಿಯ ಆದರೆ ಸ್ವಲ್ಪ ಸಣ್ಣದಾದ ಅಖಿಲಾಂಡೇಶ್ವರಿಯ ದೇಗುಲವಿದೆ. ದೇವಸ್ಥಾನದ ಎದುರು ಕಲ್ಲಿನ ಬೃಹತ್ ಬಸವನ ವಿಗ್ರಹವಿದ್ದು, ಅದರ ಒಂದು ಕಾಲಿನ ಕೆಳಭಾಗದಲ್ಲಿ ಚಿಕ್ಕ ಮಕ್ಕಳು ನುಸುಳುವಷ್ಟು ಜಾಗವಿದ್ದು, ಅದರಲ್ಲಿ ನುಸುಳಿದರೆ ಇಷ್ಟಾರ್ಥ ಪ್ರಾಪ್ತವಾಗುತ್ತದೆ ಎಂಬ ಪ್ರತೀತಿಯಿದೆ. ದೇವಸ್ಥಾನದ ಹೊರ ಆವರಣವು ಹಚ್ಚ ಹಸುರಿನ ಹುಲ್ಲು ಹಾಸಿನಿಂದ ಕಂಗೊಳಿಸುತ್ತದೆ.",
        distance: "36 km from KRS Guest House",
        image: "ikkeri.jpg",
        }

  ];

const AttractionsList = () => {


    return (
        <div className="attraction-container">
          {attractions.map((attraction, index) => (
            <div className="attraction-card" key={index}>
              <img 
                src={attraction.image} 
                alt={attraction.name} 
                className="attraction-image" 
              />
              <div className="attraction-info">
                <h1 className="attraction-title">{attraction.name}</h1>
                <p className="attraction-description">{attraction.description}</p>
                <p className="attraction-distance">Distance: {attraction.distance}</p>
              </div>
            </div>
          ))}
        </div>
      );
    };

export default AttractionsList;
